package english.thai;
import javax.swing.*;
public class About {

    public  About(){
        String d;
                d="             โปรแกรมพจนานุกรม อังกฤษ-ไทย,ไทย-อังกฤษ            "
                + "\n"
                + "\n             วิธีค้นหาศัพท์           "
                + "\n"
                + "                         พิมพ์คำศัพท์ที่ต้องการแล้วกด Enter           "
                + "\n"
                + "                         โปรแกรมจะแสดงคำที่ต้องการและคำที่ใกล้เคียง      "
                + "\n"
                + "\n             โปรแกรมนี้เป็นเพียงส่วนหนึ่งของการศึกษา       "
                
                + "\n             สร้างสรรค์ขึ้นโดยดัดแปลงมาจากพจนานุกรมเล็กซิตรอนซึ่งพัฒนาโดย   "            
                + "\n             ศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ " ;

        
        
      JOptionPane.showMessageDialog(null, d,"คำแนะนำ",JOptionPane.PLAIN_MESSAGE);
    }
        
        
    } 
    
    
